; domain
(define (domain gripper-strips-typing)
	
	(:predicates
		(person ?person)
		(location ?location)
		(box ?box)
		(type ?type)
		(gripper ?gripper)
		
		(box-at ?box ?location)
		(person-at ?person ?location)

		(box-type ?box ?type)

		(person-have ?person ?type)
		(person-dont-have ?person ?type)

		
		(gripper-at ?gripper ?location)
		(free ?gripper)
		(carry ?gripper ?box)

		(gripper-pair ?gripper1 ?gripper2)
	)

	(:action mover
		:parameters (?gripper_l ?gripper_r ?from ?to)
		:precondition (and (location ?from) (location ?to) (gripper ?gripper_l) (gripper ?gripper_r)
					(gripper-at ?gripper_l ?from) (gripper-at ?gripper_r ?from) (gripper-pair ?gripper_l ?gripper_r))
		:effect (and    
			(not(gripper-at ?gripper_l ?from)) (not(gripper-at ?gripper_r ?from))
			(gripper-at ?gripper_l ?to) (gripper-at ?gripper_r ?to))
	)
	
	(:action take-box
		:parameters (?location ?gripper  ?box)
		:precondition (and (location ?location) (box ?box) (gripper ?gripper) 
					(gripper-at ?gripper ?location) (box-at ?box ?location) (free ?gripper))
		:effect (and    
			(not (free ?gripper))
			(carry ?gripper ?box)
			(not (box-at ?box ?location))
		)
	)

	(:action let-box
		:parameters (?location ?gripper ?box ?person ?tipo)
		:precondition (and (location ?location) (box ?box)  (gripper ?gripper) (person ?person) (type ?tipo)
					(gripper-at ?gripper ?location) (person-at ?person ?location) (carry ?gripper ?box)
					(person-dont-have ?person ?tipo) (box-type ?box ?tipo)
					)
		:effect (and
			(free ?gripper)
			(not (carry ?gripper ?box))
			(person-have ?person ?tipo)
			(not (person-dont-have ?person ?tipo))
		)
	)

	

)

; problem
(define (problem strips-gripper-x-1)
	(:domain gripper-strips-typing)
	(:objects location_1 location_2 location_3 location_4 location_5 location_6 location_deposito
	box_1 box_2 box_3 box_4
	person_1 person_2 person_3
	food medicine
	gripper_1_left gripper_1_right)

	(:init
		(type food)
		(type medicine)

		(gripper gripper_1_left)
		(gripper gripper_1_right)

		(box box_1)
		(box box_2)
		(box box_3)
		(box box_4)

		(location location_1)
		(location location_2)
		(location location_3)
		(location location_4)
		(location location_5)
		(location location_6)
		(location location_deposito)
		
		(person person_1)
		(person person_2)
		(person person_3)

		(gripper-at gripper_1_left location_deposito)
		(gripper-at gripper_1_right location_deposito)

		(free gripper_1_left)
		(free gripper_1_right)

		(gripper-pair gripper_1_left gripper_1_right)
		(gripper-pair gripper_1_right gripper_1_left)

		(box-at box_1 location_deposito)
		(box-at box_2 location_deposito)
		(box-at box_3 location_deposito)
		(box-at box_4 location_deposito)


		(person-at person_1 location_4)
		(person-at person_2 location_5)
		(person-at person_3 location_6)

		(box-type box_1 food)
		(box-type box_2 food)
		(box-type box_3 medicine)
		(box-type box_4 medicine)

		(person-have person_1 food)
		(person-dont-have person_1 medicine)

		(person-have person_2 medicine)
		(person-dont-have person_2 food)

		(person-dont-have person_3 medicine)
		(person-dont-have person_3 food)
	)

	(:goal
		(and
		(person-have person_1 food)
		(person-have person_1 medicine)

		(person-have person_2 food)
		(person-have person_2 medicine)
		
		(person-have person_3 food)
		(person-have person_3 medicine)
		)
	)
)

; plan
1. (take-box location_deposito gripper_1_left box_1)
   deleted: (free gripper_1_left) (box-at box_1 location_deposito)
   added: (carry gripper_1_left box_1)
   goals met: 2 of 6
2. (take-box location_deposito gripper_1_right box_3)
   deleted: (free gripper_1_right) (box-at box_3 location_deposito)
   added: (carry gripper_1_right box_3)
   goals met: 2 of 6
3. (mover gripper_1_left gripper_1_right location_deposito location_4)
   deleted: (gripper-at gripper_1_left location_deposito) (gripper-at gripper_1_right location_deposito)
   added: (gripper-at gripper_1_left location_4) (gripper-at gripper_1_right location_4)
   goals met: 2 of 6
4. (let-box location_4 gripper_1_right box_3 person_1 medicine)
   deleted: (carry gripper_1_right box_3) (person-dont-have person_1 medicine)
   added: (free gripper_1_right) (person-have person_1 medicine)
   goals met: 3 of 6
5. (mover gripper_1_left gripper_1_right location_4 location_5)
   deleted: (gripper-at gripper_1_left location_4) (gripper-at gripper_1_right location_4)
   added: (gripper-at gripper_1_left location_5) (gripper-at gripper_1_right location_5)
   goals met: 3 of 6
6. (let-box location_5 gripper_1_left box_1 person_2 food)
   deleted: (carry gripper_1_left box_1) (person-dont-have person_2 food)
   added: (free gripper_1_left) (person-have person_2 food)
   goals met: 4 of 6
7. (mover gripper_1_left gripper_1_right location_5 location_deposito)
   deleted: (gripper-at gripper_1_left location_5) (gripper-at gripper_1_right location_5)
   added: (gripper-at gripper_1_left location_deposito) (gripper-at gripper_1_right location_deposito)
   goals met: 4 of 6
8. (take-box location_deposito gripper_1_left box_2)
   deleted: (free gripper_1_left) (box-at box_2 location_deposito)
   added: (carry gripper_1_left box_2)
   goals met: 4 of 6
9. (take-box location_deposito gripper_1_right box_4)
   deleted: (free gripper_1_right) (box-at box_4 location_deposito)
   added: (carry gripper_1_right box_4)
   goals met: 4 of 6
10. (mover gripper_1_right gripper_1_left location_deposito location_6)
   deleted: (gripper-at gripper_1_right location_deposito) (gripper-at gripper_1_left location_deposito)
   added: (gripper-at gripper_1_right location_6) (gripper-at gripper_1_left location_6)
   goals met: 4 of 6
11. (let-box location_6 gripper_1_left box_2 person_3 food)
   deleted: (carry gripper_1_left box_2) (person-dont-have person_3 food)
   added: (free gripper_1_left) (person-have person_3 food)
   goals met: 5 of 6
12. (let-box location_6 gripper_1_right box_4 person_3 medicine)
   deleted: (carry gripper_1_right box_4) (person-dont-have person_3 medicine)
   added: (free gripper_1_right) (person-have person_3 medicine)
   goals met: 6 of 6
